brbeardm/PelletPirate/pelletpirate_ESP/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Custom partition table: 2x1.5MB OTA app slots + 896K LittleFS (partitions.csv)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback: a freshly-OTA'd image that dies before main.c marks it valid
# (60s healthy uptime) reverts to the previous slot on the next boot
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# LVGL fonts
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# LVGL color settings - byte swap for SPI displays (big-endian wire format)
CONFIG_LV_DRAW_SW_SUPPORT_RGB565_SWAPPED=y

# WebSocket support for the WiFi dashboard
CONFIG_HTTPD_WS_SUPPORT=y

# Size optimization: WiFi stack + LVGL leave little app-partition headroom at -Og
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Task watchdog: actuator_task and temp_task are subscribed. A hung control
# loop with fire burning must reboot (panic) — boot re-drives all triac
# outputs LOW. 10s clears worst-case NVS/LittleFS stalls.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y
